import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  selector: 'app-vision-mission',
  standalone: true,
  imports: [CommonModule],
  templateUrl: './vision-mission.component.html',
  styleUrls: ['./vision-mission.component.css']
})
export class VisionMissionComponent {

  visionText: string = `كلية الطب بالأقصر صرح أكاديمي وإكلينيكي متميز يسهم بفاعلية في تطوير العلم والممارسة الطبية على المستوى المحلي والدولي، ويُحدث أثرًا إيجابيًا في صحة المجتمع من خلال تقديم رعاية صحية شاملة ومتكاملة وفق أعلى المعايير العالمية.`;

  missionPoints: string[] = [
    'إعداد وتخريج طبيب متسلح بخلفية علمية قوية ومهارات إكلينيكية متميزة',
    'الريادة محليًا وإقليميًا وعالميًا في التدريب الطبي وتوفير بيئة تعليمية مبتكرة',
    'البحث العلمي والإسهام العلمي على المستوى المحلي والدولي',
    'المساهمة الفعالة في تحقيق التنمية الشاملة للمجتمع وتحسين صحة أفراده من خلال دمج وتطبيق البحث العلمي مع التدريب، والمشاركة الفعالة في كل ما يتعلق بصحة المجتمع بما في ذلك الإجراءات الوقائية والعلاجية والتشريعية.'
  ];

  connectionPoints: string[] = [
    'تسهم كلية الطب في التميز في التعليم الطبي والبحث العلمي مما يؤدي إلى اقتصاد تنافسي قائم على الابتكار والمعرفة، وهو أحد محاور رؤية مصر 2030.',
    'تخدم كلية الطب بجامعة الأقصر شريحة كبيرة من الطبقات الفقيرة والمتوسطة وتوفر لهم خدمات طبية متميزة، مما يسهم في تحقيق العدالة الاجتماعية وحق جميع الفئات في الحصول على خدمات طبية متميزة، وهو هدف أساسي من أهداف رؤية مصر 2030.',
    'تسعى الكلية من خلال رؤيتها ورسالتها إلى تلبية احتياجات المجتمع بتخريج أطباء متميزين يخدمون الوطن ويحسنون الرعاية الصحية للمصريين، وتسخير البحث العلمي لحل المشكلات الطبية في المجتمع المصري، مما يؤدي إلى تحقيق التنمية المستدامة ورفع جودة حياة المواطن المصري.'
  ];
}